app/controllers/items_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "items" ("description", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "The Great Gatsby"], ["list_id", 2], ["created_at", "2016-04-26 14:43:52.954435"], ["updated_at", "2016-04-26 14:43:52.954435"]]
---
  def create
    #because of nested resource, params has :list_id
    @list = List.find(params[:list_id])
    #use collection builder method to associate item with list, but not save
    @item = @list.items.build(item_params)
    #validate before saving
    if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "items" SET "status" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["status", 1], ["updated_at", "2016-04-26 16:35:33.643276"], ["id", 3]]
---
  def update
    @item = Item.find(params[:id])
    @item.update(item_params)