app/controllers/lists_controller.rb

  def index #doubles as #new action
    @list = List.new #stub out new @list for form_for FormHelper
    @lists = List.all #query db for all @lists
---
SELECT "lists".* FROM "lists"

  def create
    @list = List.new(list_params)
    if @list.save
      redirect_to list_path(@list)
    else
      @lists = List.all
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Chores"], ["created_at", "2016-04-26 12:57:04.405043"], ["updated_at", "2016-04-26 12:57:04.405043"]]
SELECT "lists".* FROM "lists"